def proc1():
    countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин",
                      "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                      "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава",
                      "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                      "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(countries_dict)
    print('Введите страну')
    s = input()
    print(countries_dict[s])
    for key in sorted(countries_dict):
        print(key, ' - ', countries_dict[key])

def proc2():
    alph = {
        "а": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 1,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ш": 8,
        "щ": 10,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3
    }
    s = 0
    word = input('Введите слово: ')
    for i in word:
        s += alph[i.lower()]
    print('Сумма:', s)

def proc3():
    import random
    students = {"Кутилина", "Петров", "Поликарпова", "Аги", "Лавриненко", "Семенов"}
    languages = {"Английский", "Корейский", "Немецкий", "Китайский"}
    k = {}

    for i in students:
        chis = random.randint(1, 3)
        k[i] = random.sample(list(languages), chis)

    lang = set()
    for i in k:
        lang = lang.union(set(k[i]))

    ch = [i for i in k if "Китайский" in k[i]]
    print('Языки:', *sorted(languages))
    print("Люди, знающие китайский: ", *ch)

proc1(), proc2(), proc3()